//
//  AgreementText.swift
//  Cider
//
//  Created by 임영선 on 2023/08/26.
//

import Foundation

final class CommonText {
    
    static let agreement =
"""
서비스 이용 약관

목적

제1조 (목적)

1. 본 약관은 회원(본 약관에 동의한 자를 말합니다 이하 “회원”이라고 합니다)이 “(주)지금”(이하 “회사”라 합니다)가 제공하는 “지금 서비스”(이하 ‘서비스’라 합니다)를 이용함에 있어 “회사”와 “회원”의 권리·의무 및 책임 사항을 규정함을 목적으로 합니다.
2. 회사는 지금 서비스 내부의 개별 서비스에 대해 별도의 이용약관 또는 정책을 둘 수 있으며, 그 내용이 이 약관과 충돌하는 경우 별도의 약관이 우선하여 적용됩니다.

약관 외 준칙

제2조 (약관 외 준칙)

1. 본 약관에 명시되지 않은 사항이나 해석에 대해서는 「전기통신사업법」, 「정보통신망 이용 촉진 및 보호 등에 관한 법률」등 관련 법령 또는 상관례에 따릅니다

용어의 정의

제3조 (용어의 정의)

1. 이 약관에서 사용하는 용어의 정의는 다음과 같습니다.
    
    ① “이용자”란 본 약관에 따라 “서비스”에 접속하여 회사가 제공하는 서비스를 이용하는 “회원” 및 “비회원”을 말합니다.
    
    ② “서비스”란 유·무선 단말기의 종류와는 상관없이 모바일 환경에서 “회사”가 제공하는 이용 가능한 모든 행위를 말합니다.
    
    ③ “회원”이란 본 약관에 따라 회사와 이용계약을 체결하고 회사가 제공하는 서비스를 지속적으로 이용할 수 있는  자를 말합니다.
    
    ④ “이용계약”이란 “서비스” 이용과 관련하여 “회사”와 “이용자” 간 체결하는 계약을 말합니다.
    
    ⑤ “지금”이란 회원이 “챌린지”에 참가하여, 일정기간 동안 정해진 목표를 실천하며 “인증”하고, 목표 달성률에 따라 “경험치”와 레벨을 획득하는 내용의 서비스를 제공하는 어플리케이션을 말합니다.
    
    ⑥ “경험치”란 제4조에 따라 이용자가 일정한 행위를 마친 때에 시스템에 무상으로 적립 및 기록되는 서비스상의 데이터를 말합니다. “경험치”라는 용어는 추후 회사 사정에 따라 변경될 수 있습니다.
    
    ⑦ “챌린지”란 회사가 정한 조건에 따라 일정기간 동안 정해진 목표를 실천하며 “인증”하는 모바일 플랫폼을 말합니다. 챌린지마다 참가기준은 다를 수 있으며, 이용자에 따라 다른 챌린지를 제공할 수 있습니다.
    
    ⑧ “인증”이란 회원이 서비스에서 “콘텐츠”를 업로드하는 행동으로, 챌린지의 목표를 정당한 방법으로 수행하기 위해 회사가 규정한 미션을 준수하고 있음을 회사가 승인한 것을 의미합니다. 회사는 회원이 업로드한 콘텐츠를 기준으로 인증 여부를 판단합니다.
    
    ⑨ “콘텐츠”란 회사가 서비스를 위해 회원에게 제공하는 내용물 일체 [텍스트, 음성, 영상, 정보 형태의 글, 사진(이미지), 네트워크 서비스를 포함하되 이에 한정되지 아니합니다]를 의미합니다.
    
    ⑩ “호스트”란 챌린지를 주최하는 주최 자를 의미합니다. “호스트”라는 용어는 추후 회사 사정에 따라 변경될 수 있습니다.
    
    ⑪ “챌린저”란 챌린지에 참가하고 있는 참가자를 의미합니다.
    
    ⑫ “공식 챌린지”란 회사가 직접 주최하는 챌린지를 말합니다.
    
    ⑬ “인기 챌린지”란 회사가 정한 기준에 의해, 전체 챌린지 중 회원의 참여도가 높은 챌린지를 말합니다. “인기 챌린지”라는 용어는 추후 회사 사정에 따라 변경될 수 있습니다.
    
    ⑭ “추천 피드”란 회사가 정한 기준에 의해, 챌린지 홈에 피드를 노출되는것을 말합니다. “추천 피드”라는 용어는 추후 회사 사정에 따라 변경될 수 있습니다.
    
    ⑮ “검토 중”이란 사용자가 챌린지 제작 신청 후 관리자 승인 전 기간을 말합니다.
    
    ⑯ ”모집 중”이란 챌린지 시작 전 참여 인원을 확보하기 위한 모집 기간을 말합니다.
    
    ⑰ ”진행 중”이란 챌린지 종료일 기준, 남은 챌린지 도전 일이 챌린지 인증 횟수 이상일 경우 표시되는 기간을 말합니다.
    
    ⑱ ”진행 중/참여 불가”란 챌린지 종료일 기준, 남은 챌린지 도전 일이 챌린지 인증횟수 미만일 경우 표시되는 기간을 말합니다.
    
    ⑲ ”종료”란 이용자가 참가한 챌린지가 호스트의 설정 기간에 의해 챌린지 종료된 경우를 말합니다.
    
    ⑳ “평균 현황”이란 이용자가 참가한 챌린지내 참여 챌린저들의 챌린지 성공률 평균값으로, 해당 챌린지 평균 진행 현황을 말합니다.
    
    ㉑ “나의 현황”이란 이용자가 참가한 챌린지내 ‘내 챌린지 성공률 평균값’으로, 해당 챌린지의 내 진행 현황을 말합니다.
    
2. 본 약관에서 사용하는 용어 중 위에서 정하지 아니한 것은 본 약관의 다른 조항 또는 사이다 어플리케이션 상 개별 서비스별 정책 또는 안내 등에서 정하는 바에 의하며, 이에 정하지 아니한 것은 관계 법령 및 일반 관행에 따릅니다.

경험치 적립

제4조 (경험치 적립)

1. 회사가 회원에게 제공하는 경험치 적립 경로는 다음과 같습니다. 단, 경험치 적립 경로는 회사의 사정에 따라 달라질 수 있습니다.
    
    ① 이용자가 챌린지 참여 요청을 한 뒤 해당 챌린지를 처음 입장한 경우
    
    ② 이용자가 참가하고 있는 챌린지에 인증 행위를 완료한 경우
    
    ③ 이용자가 참가한 챌린지가 종료된 경우
    
2. 적립된 경험치 내역은 서비스 내 마이페이지 화면에서 확인하실 수 있습니다. 경험치 획득을 위한 활동 후, 인증을 취소하거나 인증 콘텐츠에 신고가 접수된 경우 경험치는 회수 될 수 있습니다.

이용약관의 효력 및 변경

제5조 (이용약관의 효력 및 변경)

1. 회사는 본 약관의 내용을 회원이 알 수 있도록 서비스의 전용 앱에 게시함으로써 이를 알리고, 합리적인 사유가 발생될 경우에는 이 약관을 변경할 수 있으며, 약관을 변경할 경우에는 지체 없이 이를 사전에 공지합니다.
2. 본 약관은 서비스 화면에 게시하거나 기타의 방법으로 이용자에게 공시함으로써 효력이 발생합니다.
3. 회사는 관련 법령 (「콘텐츠산업 진흥법」, 「정보통신망 이용촉진 및 정보보호 등에 관한 법률」, 「약관의 규제에 관한 법률」, 「소비자 기본법」등) 관련 법령을 위배하지 않는 범위에서 본 약관을 개정할 수 있습니다.
4. 회사가 본 약관을 개정할 경우에는 개정약관 및 개정 시행일자와 개정사유를 명시하여 그 시행일자 7일 이전부터 시행일 이후 상당한 기간 동안 본 서비스 페이지에 게시합니다. 단, 이용자에게 불리한 변경 또는 중대한 사항의 변경은 30일 이상의 사전 유예기간을 두고 공지합니다.
5. 기존 회원에게는 변경될 약관, 적용일자 및 변경사유(중요내용에 대한 변경인 경우 이에 대한 설명을 포함)를 이메일 또는 앱 푸시 & 앱 공지사항으로 발송하고, 개정된 약관은 그 시행일에 효력이 발생합니다.
6. 회사가 정한 개정약관 시행일까지 거부의사를 표시하지 않는 회원의 경우 개정 약관에 동의하신 것으로 봅니다.
7. 회원이 개정약관의 적용에 동의하지 않는 경우 회사 또는 회원은 이용계약을 해지할 수 있습니다.

이용계약의 성립

제6조 (이용계약의 성립)

1. 이용계약은 가입신청자가 본 약관에 대한 동의하고 서비스 가입을 신청한 다음, 회사가 이를 수락함으로서 성립됩니다.
2. 가입신청자가 서비스 회원 가입 페이지의 '동의' 버튼을 클릭하거나 서비스의 이용을 시작한 경우 본 약관에 동의한 것으로 간주합니다.
3. 가입신청자는 가입신청시 진실한 정보를 기재하여야 하며, 허위의 정보를 기재한 경우 서비스 이용에 제한이 있을 수 있고, 나아가 그로 인한 불이익 및 법적 책임은 가입신청자에게 있습니다.
4. 회사는 다음 각 호에 해당하는 경우에는 승낙하지 않을 수 있습니다.
    
    ① 가입 신청시 제공한 정보에 허위, 기재누락, 오기가 있는 경우
    ② 서비스를 제공하기에는 회사의 기술상으로 문제가 있다고 판단되는 경우
    ③ 회사의 업무를 방해하기 위한 부정한 목적을 가지고 가입신청을 하거나, 법령위반, 회사가 정한 사항 등 승낙이 불가능한 사유가 있는 경우
    
    ④ 이용자의 귀책사유로 인하여 회사가 이용계약을 해지했던 회원이 다시 서비스 이용신청을 하는 경우, 단 회사로부터 재가입 승낙을 받은 경우는 예외로 함
    
5. 본 서비스의 이용계약은 회사가 신청절차 상에서 가입 완료를 표시한 시점에 성립합니다. 이용자는 가입신청시 기재한 정보에 변동이 생긴 경우 이를 수정하거나 회사에 통지하여야 하며 수정 또는 통지하지 않음으로 인한 불이익에 대하여 회사는 책임지지 않습니다.

서비스 제공 및 이용

제7조 (서비스 제공 및 이용)

1. 사이다는 금융 소비 습관을 기르고 싶은 사람들에게 금융 지식과 소비 습관을 기른다는 목적 하에 제공되는 서비스입니다.
2. 회사가 이용자에게 제공하는 서비스의 기본 내용은 다음과 같습니다. 회사는 다음 각 호에 언급된 서비스 외에도 회사가 개발하거나 다른 회사와의 제휴를 통해 이용자에게 신규 서비스, 이벤트 등을 제공할 수 있습니다.
    
    ① 챌린지 서비스 : 이용자가 챌린지에 참가하여 목표 달성에 따라 경험치를 지급받는 내용의 서비스 및 이에 부가한 기타 서비스
    
    ② 경험치 적립: 제 4조의 행위를 완료한 이용자에게 경험치를 적립
    
    ③ 인증 피드 : 회사가 요청하는 사진, 글 등을 업로드 하여 회원간 소통을 위한 공간 제공
    
    ④ 기타 위 각 호 관련 부가서비스
    
3. 회사는 회사 서비스 정책, 제휴사 요구 또는 관련 법규 준수를 위하여 일부 서비스에 대해서는 이용 가능한 이용자 범위를 다르게 설정할 수 있습니다.
4. 회사는 이용자에게 서비스를 제공하기 위하여 회원에게 회사 또는 회사와 제휴한 제3자의 광고 등을 노출할 수 있습니다.
5. 제휴사의 사정이나 불가피한 계약 변경에 따라 서비스 내용은 변경 또는 종료 될 수 있으며 이 경우 1개월 전에 서비스 홈페이지를 통해 고지 후 서비스를 변경 또는 종료합니다. 다만, 제휴사의 정책 변경 또는 회사의 경영상 사정 등으로 인하여 즉시 서비스를 제공하는 것이 불가능한 경우에는 종료 후 즉시 통지합니다.
6. 이용자는 회사가 제공하는 본 서비스의 이용을 위해 이용자의 본인확인, 인증, 정보의 수집이용제공 등에 대한 동의 등이 필요할 수 있으며, 본 서비스의 이용 요건 및 서비스 제공 내용은 관련법령, 정부의 정책, 회사의 방침 변화에 따라 변경될 수 있습니다.

서비스 이용제한

제8조 (서비스 이용제한)

1. 회사는 다음 각 호에 해당하는 사유가 발생한 경우에, 해당 이용자에 대하여 서비스 이용을 제한 또는 중지시킬 수 있습니다.
① 회원이 회사의 서비스 운영을 고의 또는 과실로 방해하는 경우
② 회사가 이용자의 단말기 특성 또는 OS 버전의 문제로 인해 정상적인 서비스 제공이 불가능하다고 판단한 경우
③ 회사의 보안정책에 따라 서비스 제한이 필요하다고 회사가 판단하는 경우
    
    ④ 기타 중대한 사유로 인하여 회사가 해당 회원에 대해 서비스 제공을 지속하는 것이 상당하지 않다고 판단되는 경우
    
2. 회사는 전항의 규정에 의하여 서비스의 이용을 제한하거나 중지한 때에는 그 사유 및 제한 기간 등을 회원에게 알립니다. 영구이용정지, 이용계약 해지시 서비스 이용을 통해 획득한 경험치 및 기타 혜택 등도 모두 소멸되며, 회사는 이에 대해 별도로 보상하지 않습니다.
3. 회사의 제재에 대하여 이견이 있는 경우에는 30일 이상의 기간을 정하여 이용자에게 소명할 기회를 부여하며, 상기 소명 기회 부여는 이용자의 서비스 이용 제한 또는 정지 상태에서 이루어질 수 있습니다.

이용자의 의무

제9조 (이용자의 의무)

1. 회사가 이용자에게 제공하는 서비스에 대한 지식재산권을 포함한 일체의 권리는 회사에 귀속됩니다.
회원은 해당 행위를 하는 경우에 회사는 이용자의 서비스 이용을 제한하거나 그 사유가 중대한 경우 일방적인 계약 해지 및 적법 조치를 포함한 제재를 가할 수 있습니다.
2. 이용자는 다음 각 호의 행위를 하여서는 안 됩니다.
① 회원 정보에 허위내용을 등록하거나 중복하여 가입하는 행위
② 회사의 서비스에 게시된 정보를 변경, 또는 서비스를 이용하여 얻은 정보를 회사의 사전 승낙 없이 영리 및 비영리의 목적으로 복제·출판·방송 등에 사용하거나 제3자에게 제공하는 행위
③ 타인의 ID 및 개인정보를 도용하는 행위
④ 회사 또는 기타 제3자의 명예나 훼손하거나 지식재산권을 침해하는 등 회사나 제3자의 권리를 침해하는 행위
⑤ 외설 또는 폭력적인 메시지· 정크메일· 스팸메일· 화상·음성 등이 담긴 내용을 게시하거나 공공질서 또는 공서양속에 반하는 정보를 공개 또는 게시하는 행위
⑥ 공공질서 또는 미풍양속에 위배되는 내용의 정보, 문장, 도형, 음성 등을 유포하는 행위
⑦ 고의 또는 과실로 허위의 정보를 공개 또는 유포하는 행위
⑧ 회사의 서비스를 무단 변경/변조하거나 회사의 서버를 해킹하는 등의 시스템 위협 행위
⑨ 다량의 정보를 전송하거나, 동일한 또는 유사한 내용의 정보를 반복적으로 게시하여 서비스의 안정적인 운영을 방해하는 행위
    
    ⑩ 부정한 방법으로 경험치를 획득 또는 사용하는 행위
    
    ⑪ 다른 이용자의 개인정보를 동의 없이 수집, 저장, 공개하는 행위
    ⑫ 회사의 승인을 받지 않고 타인의 개인정보를 수집 또는 저장하는 행위
    ⑬ 범죄와 결부된다고 객관적으로 판단되는 행위
    ⑭ 「정보통신망 이용촉진 및 정보보호 등에 관한 법률」 에서 금지하는 행위 등 기타 불법적이거나 부당한 행위
    ⑮ 본 약관을 포함하여 기타 회사가 정한 제반 규정 또는 이용 조건을 위반하는 행위
    
3. 회사는 이용자가 전항 각 호의 행위를 하는 경우 해당 게시물 등을 삭제 또는 임시 조치할 수 있고 해당 이용자의 서비스 이용을 제한하거나 그 사유가 중대한 경우 일방적으로 본 계약을 해지할 수 있습니다.
4. 이용자가 전항 각 호의 행위를 함으로써 회사에 손해가 발생한 경우, 회사는 해당 이용자에 대해 손해배상을 청구할 수 있습니다.
5. 이용자는 회사의 사전 승낙 없이 서비스를 이용하여 영업활동을 할 수 없으며, 그 영업활동의 결과에 대해 회사는 책임을 지지 않습니다. 또한 이용자가 이와 같은 영업활동으로 회사가 손해를 입은 경우, 해당 이용자는 회사에 대해 손해배상의무를 지며, 회사는 이용자에 대해 서비스 이용제한 및 적법한 절차를 거쳐 손해배상 등을 청구할 수 있습니다.
6. 본 서비스 내에서 회사의 관여 없이 이용자간 이루어지는 일체의 행위(거래 행위 포함)와 관련하여 발생하는 모든 의무와 책임은 해당 회원에게 있으며, 회사는 그 내용에 대하여 책임을 지지 않습니다.

게시물 관리

제10조 (게시물 관리)

서비스 내 모든 게시물 및 콘텐츠의 관리와 운영 권한은 해당 게시물 및 콘텐츠를 게시한 회원에게 있습니다.

단 다른 회원의 요청이 있거나 기타 회사가 서비스의 원활한 운영을 위하여 필요하다고 판단되는 경우, 회사는 게시물의 관리 등과 관련한 사항을 개선, 지원하는 등의 활동을 할 수 있습니다.

회원의 게시물 등이 관련 법령에 위반되는 내용을 포함하는 경우, 회사는 해당 관련 법령이나 적법한 권리자의 요청에 따라 해당 게시물 등에 대한 게시 중단 및 삭제 등의 조치를 취할 수 있습니다.

1. 본 조에서 정한 정책은 사진, 텍스트를 포함한 모든 게시물 형식에 적용됩니다.
2.  게시물은 전체 공개를 원칙으로 하며, 공개되는 정보에는 프로필 사진, 닉네임 등이 노출될 수 있습니다.
3.  회사는 다음 각 호에 해당하는 사유가 발생한 경우, 게시물이나 자료를 사전통지 없이 삭제하거나 임시조치(블라인드)할 수 있습니다.
    
    ① 회사의 이용약관 및 정책 등에 위배되거나 기타 관계법령에 위배되는 등 공공질서 및 미풍양속에 위반되는 내용인 경우
    ② 인종, 성별, 지역, 종교, 정치 등 차별 및 비하, 폄하하거나 이용자간 분쟁을 유발시키는 게시물인 경우
    ③ 타사의 광고, 홍보 등 영리를 목적으로 하는 광고일 경우
    ④ 제3자의 저작권, 지적재산권, 초상권 등 권리를 침해하거나 정확하지 않은 정보 또는 허위 정보, 제3자의 명예를 훼손하거나 경우
    ⑤ 이용자의 개인적 영리 추구를 위해 직접 또는 제3자(가족, 지인, 대행 업체 등)를 통하여 위법으로 허위 또는 과장된 게시물을 게재하고 공감수를 늘리거나 신고하는 행위인 경우
    ⑥ 타 이용자의 개인정보(성명, 주소, 전화번호 등)를 게시물에 무단 노출하여 개인정보보호법을 위반하는 경우
    ⑦ 대한민국 형법에 의거하여 범죄적 행위에 결부된다고 판단되는 게시물인 경우
    
    ⑧ 해당 게시판의 목적과 관련 없는 경우
    
    ⑨ 회사의 대내외적 명예나 평판을 저하시키는 내용을 기록한 경우
    ⑩ 성희롱, 폭언, 욕설, 음란, 근거 없는 일방적 비방 등 회사 또는 타 이용자에게 혐오감, 불쾌감을 유발하는 경우
    ⑪ 정상적인 서비스 운영에 방해가 되거나, 지장, 분란 또는 불편을 일으키는 게시물인 경우
    
4. 회사는 제3항의 위반 사유가 확인되었거나 3회 이상 신고를 받은 회원에 대하여 서비스의 이용을 제한할 수 있으며, 계정을 중지시키고 이용계약을 해지할 수 있습니다. 단, 누적 신고 횟수는 회사의 운영방침에 따라 갱신할 수 있습니다.
5. 회사는 서비스 내에 게시된 게시물 등이 사생활 침해 또는 명예훼손 등 제3자의 권리를 침해한다고 인정하는 경우 회원 또는 제3자의 신고가 없는 경우에도 게시물을 삭제 처리할 수 있습니다.
6. 이용자가 게시물 서비스를 이용하는 과정에서 명예훼손, 모욕 등 관련 법령을 위반하는 경우 해당 법령에 따른 민형사상 법적 책임을 질 수 있습니다.
7. 회원의 게시물이 타인의 저작권, 타인의 명예 등 타인의 권리를 침해함으로써 발생하는 민, 형사상의 책임은 전적으로 회원이 부담하여야 합니다.
8. 회사는 이용자의 게시물에 대해 적법성, 정확함, 진실성 등을 보증하지 않습니다.

게시물에 대한 저작권

제11조 (게시물에 대한 저작권)

1. 회사가 회원에게 제공하는 상표, 로고, 서비스 및 광고 등 회사가 제작, 제공하는 것에 대한 지식재산권 등의 권리는 회사에 귀속합니다.
2. 회원이 서비스를 이용하는 과정에서 작성한 게시물에 대한 저작권을 포함한 일체의 권리는 각 회원에게 귀속됩니다. 회원은 자신이 서비스에 게시한 게시물 등을 회사가 국내·외에서 다음 각 호의 목적으로 사용하는 것을 허락합니다.
① 서비스 내에서 게시물 등의 복제·전송·전시 및 우수 게시물을 서비스 화면에 노출하기 위하여 게시물의 내용 변경 없이 크기를 변환하거나 단순화하는 등의 방식으로 수정하는 것
② 회사의 서비스를 홍보하기 위한 목적으로 인터넷, 모바일, SNS를 포함한 디지털 마케팅 채널 및 통신사 등에게 콘텐츠의 내용을 보도, 방영하는 것
③ 콘텐츠를 복제ᆞ전송ᆞ전시하는 방법으로 제휴서비스에서 콘텐츠를 제공하는 경우
3. 회사는 전항 이외의 방법으로 회원의 게시물 등을 이용하고자 하는 경우에는 사전에 회원의 동의를 얻습니다.
4. 회원이 서비스에 게시물을 게재하는 것은 다른 회원이 게시물을 서비스 내·외에서 사용하거나 회사가 검색결과로 사용하는 것을 허락한 것으로 봅니다.

정보의 제공 및 광고의 개제

제12조 (정보의 제공 및 광고의 게재)

1. 회사는 이용자에 대한 고지 수단으로써 회사 홈페이지 및 앱의 구좌배너를 이용하거나, 이용자의 단말기 번호 또는 이메일 등을 이용할 수 있습니다. 또한 회사는 같은 방법으로 서비스의 운영과 관련한 영리 목적의 광고성 정보를 제공할 수 있습니다.
2. 다만 이용자의 단말기 번호 또는 이메일 등을 이용한 광고성 정보 전송은 이용자의 사전 수신동의가 있거나 법령상 허용된 경우에 한하여 제공되며, 이용자는 이에 대하여 이메일 또는 앱 내 설정 등을 통해 수신거절 할 수 있습니다.

약관 동의 철회

제13조 (약관 동의 철회)

1. 서비스 해지시 약관 동의가 철회됩니다.

(시행일) 본 약관은 2023년 8월 24일부터 시행합니다.
"""
    
    static let privacy =
"""
개인정보 처리 방침

(주)지금(이하 “회사”)는 이용자의 개인정보보호를 소중하게 생각하고,  「정보통신망 이용촉진 및 정보보호 등에 관한 법률」, 「개인정보보호법」 등을 준수합니다. 또한 관계 법령 및 개인정보보호 규정, 가이드라인을 준수하고 있습니다. 본 개인정보수집방침은 회사에서 운영하는 지금 서비스(이하 “지금”)에 적용됩니다.

회사는 정부의 법률 및 지침 변경 등에 따라 수시로 개인정보처리방침을 바꿀 수 있고, 이에 따른 개인정보처리방침의 지속적인 개선을 위하여 필요한 절차를 정하고 있습니다. 그리고 개인정보처리방침을 개정하거나 변경할 때에는 홈페이지를 통해 해당 내용을 알리고 있습니다.

제 1조. 개인정보의 수집 및 이용 목적

회사는 이용자의 개인정보를 아래의 목적으로 이용하며, 이용자의 별도 동의가 있는 경우나 법령에 규정된 경우를 제외하고는 이용자의 개인정보를 목적 외로 이용하지 않습니다.

1. 회원가입 및 관리 회원 가입의사 확인, 회원제 서비스 제공에 따른 본인 식별·인증, 회원자격 유지·관리, 제한적 본인확인제 시행에 따른 본인확인, 서비스 부정이용 방지, 각종 고지·통지, 고충처리, 분쟁 조정을 위한 기록 보존 등을 목적으로 개인정보를 처리합니다.
2. 이용자 요청사항 처리 이용자의 신원 확인, 요청사항 확인, 사실조사를 위한 연락·통지, 처리결과 통보 등을 목적으로 개인정보를 처리합니다.
3. 서비스 제공 및 개선
- 서비스 및 콘텐츠 제공을 위한 본인 인증 등을 목적으로 개인정보를 처리합니다.
- 신규 서비스 개발 및 맞춤 서비스 제공을 위해 이용자의 서비스 이용에 대한 통계 등을 목적으로 개인정보를 처리합니다.
- 기타 서비스, 신규 정보 안내 및 이벤트 정보 안내를 위해 개인정보를 수집합니다.
- 서비스 제공, 콘텐츠 제공, 본인인증 등을 목적으로 개인정보를 처리합니다.

제 2조. 개인정보 수집항목 및 방법

회사는 회원가입, 원활한 고객상담, 각종 서비스 등 기본적인 서비스 제공을 위하여 아래와 같은 개인정보를 수집합니다.

- 회원가입 및 서비스 이용 과정에서 이용자가 개인정보 수집에 대해 동의를 하고 수집하는 정보 : 휴대폰 번호, 이동통신사, 성명, 생년월일, 성별, 내외국인정보, CI, DI
- 서비스 이용 과정에서 자동으로 생성/수집되는 정보 : 서비스이용기록, 단말기 모델명, 단말기식별번호, OS(Androiod/iOS) 및 버전, PUSH 토큰, 단말접속일시, 세션아이디, 단말 MAC address 사용자 위치정보
- 상기 단말기에 관한 정보는 개인을 식별할 수 없는 형태이며 회사는 수집된 정보를 바탕으로 개인을 식별하는 일체의 활동을 하지 않습니다.
- 이벤트 참여 등의 부가 서비스 이용 시 본 개인정보처리방침이 적용되며 별도의 추가 개인정보 처리 시 이에 대한 동의를 이용자에게 받습니다.

제 3조 개인정보 수집에 대한 동의

회사는 개인정보 수집에 대한 동의를 받습니다. 회원의 개인정보 수집과 관련하여 회사의 개인정보보호방침 또는 이용약관의 내용에 대해 ‘동의' 여부를 체크할 수 있는 절차를 마련하여, 회원가입시 ‘동의'를 체크하면 개인정보 수집에 동의한 것으로 간주합니다.

제 4조. 개인정보 제공 및 위탁

회사는 이용자의 개인정보를 원칙적으로 외부에 공개하지 않습니다. 단, 법령 규정에 의거하거나 수사 목적으로 법령에 정해진 절차와 방법에 따라 수사기관의 요구가 있는 경우, 이용자의 별도 동의가 있는 경우는 예외로 합니다.

제 5조. 개인정보의 파기절차 및 방법

회사는 원칙적으로 개인정보 수집 및 이용목적이 달성된 후에는 해당 정보를 지체 없이 파기합니다. 파기절차 및 방법은 다음과 같습니다.

1. 파기절차 : 회원님이 회원 가입 등을 위해 입력하신 정보는 목적이 달성된 후 별도의 DB로 옮겨져 내부 방침 및 기타 관련 법령에 의한 정보보호 사유에 따라(보유 및 이용기간 참조) 일정 기간 저장된 후 파기 됩니다. 별도 DB로 옮겨진 개인정보는 법률에 의한 경우가 아니고 서는 보유되거나 이외의 다른 목적으로 이용되지 않습니다.
2. 파기방법 : 전자적 파일형태로 저장된 개인정보는 기록을 재생할 수 없는 기술적 방법을 사용하여 삭제합니다.

제 6조. 개인정보의 보유 및 이용 기간

회사는 원칙적으로 이용자의 개인정보를 보유기간이 경과되면 지체없이 파기하고 있습니다. 단, 이용자에게 개인정보 보관기간에 대해 별도의 동의를 얻은 경우 혹은 법령에서 일정 기간 정보보관 의무를 부과하는 경우에는 해당 기간 동안 개인정보를 안전하게 보관합니다.

1. 서비스 제공을 위해 수집한 회원가입 정보 : 회원탈퇴 후 15일 까지
2. 법령에 의한 개인정보 보유
- 표시/광고에 관한 기록

◦ 보존근거 : 전자상거래 등에서의 소비자보호에 관한 법률

◦ 보존기간 : 6개월

- 계약 또는 청약철회 등에 관한 기록

◦ 보존근거 : 전자상거래 등에서의 소비자보호에 관한 법률

◦ 보존기간 : 5년

- 소비자의 불만 또는 분쟁처리에 관한 기록

◦ 보존근거 : 전자상거등에서의 소비자보호에 관한 법률

◦ 보존기간 : 3년

- 신용정보의 수집, 처리 및 이용 등에 관한 기록

◦ 보존근거 : 신용정보의 이용 및 보호에 관한 법률

◦ 보존기간 : 3년

- 본인확인에 관한 기록보존

◦ 보존근거 : 정보통신망 이용척진 및 정보보호에 관한 법률

◦ 보존기간 : 6개월

- 접속에 관한 기록보존

◦ 보존근거 : 통신비밀보호법에 관한 법률

◦ 보존기간 : 3개월

회사는 회원이 1년간 로그인 기록이 없는 경우, 해당 개인정보는 ‘정보통신망 이용촉진 및 정보보호 등에 관한 법률 29조에 근거하여 회원에게 사전통지하고 개인정보를 파기하거나 별도로 분리하여 저장 관리합니다. 단, 관계 법령에 의한 개인정보 보존이 필요한 경우에는 규정된 기간 동안 보관합니다.

제7조. 이용자 및 법정대리인의 권리와 그 행사방법

1. 이용자 및 법정 대리인은 언제든지 등록되어 있는 자신 혹은 당해 만 14세 미만 아동의 개인정보를 조회하거나 수정할 수 있으며 가입 해지를 요청할 수도 있습니다.
2. 이용자 혹은 만 14세 미만 아동의 개인정보 조회, 수정 및 삭제를 위해서는 개인정보관리책임자에게 서면, 전화 또는 이메일로 연락하시면 지체 없이 조치하겠습니다.
3. 이용자 및 법정대리인이 개인정보의 오류에 대한 정정을 요청하신 경우에는 정정을 완료하기 전까지 당해 개인정보를 이용 또는 제공하지 않습니다. 또한 잘못된 개인정보를 제3자 에게 이미 제공한 경우에는 정정 처리결과를 제3자에게 지체 없이 통지하여 정정이 이루어지도록 하겠습니다.
4. 회사는 이용자 혹은 법정 대리인의 요청에 의해 해지 또는 삭제된 개인정보는 “회사가 수집하는 개인정보의 보유 및 이용기간”에 명시된 바에 따라 처리하고 그 외의 용도로 열람 또는 이용할 수 없도록 처리하고 있습니다.

제8조 개인정보 보호 책임자

회사는 개인정보처리에 관한 업무를 총괄해서 책임지고 개인정보 처리와 관련한 정보주체의 불만처리 및 피해구제 등을 위하여 아래와 같이 개인정보 보호책임자를 지정하고 있습니다.

- 개인정보 보호책임자
    - 책임자: 박사랑
    - 문의: jigeum.challenge@gmail.com
    
- 기타 개인정보침해에 대한 신고나 상담이 필요하신 경우에는 아래 기관에 문의하시기 문의하시기 바랍니다.
    - 개인정보분쟁조정위원회 (kopico.go.kr / 1833-6972)
    - 개인정보침해신고센터 (kisa.or.kr / 118)
    - 대검찰청 첨단범죄수사센터 (spo.go.kr/ 02-3480-2000)
    - 경찰청 사이버안전국 (police.go.kr / 182)
    

제9조 고지의무

본 개인정보처리방침은 시행일로부터 적용되며, 법령 및 방침에 따른 변경내용의 추가, 삭제 및 정정이 있는 경우에는 변경사항의 시행 7일 전부터 공지사항을 통하여 고지할 것입니다. 다만 이용자의 소중한 권리 또는 의무에 중요한 내용 변경이 발생하는 경우 시행일로부터 최소 30일전에 공지하도록 하겠습니다.

- (시행일) 본 개인정보처리방침은 2023년 8월 24일부터 시행합니다.

회사는 모든 이용자들의 개인정보를 소중히 여기며, 이용자들이 안심하고 서비스를 이용하실 수 있도록 개인정보 보호에 노력을 기울이겠습니다.
"""
    
}
